import 'package:get/get.dart';

import '../../../base_controller/base_controller.dart';

class TermsOfServicesLogic extends BaseController {
  bool responsibility = false;
  bool agree = false;

  updateAgree(checked) {
    agree = checked;
    update();
  }

  updateResponsibility(checked) {
    responsibility = checked;
    update();
  }

  bool showCheckBox = true;

  @override
  void onInit() {
    // TODO: implement onInit
    super.onInit();

    if (Get.arguments != null && Get.arguments == false) {
      showCheckBox = false;
      update();
    }
  }

  static const termsOfServicesText = ''
      '-GlobCare  منصة لتقديم الاستشارات الصحية عن بعد والمعلومات الصحية العامة الموثوقة باستخدام الصوت والفيديو التفاعلي والتكنولوجيا الرقمية بإنشاء علاقة مؤقتة بين الطبيب والمريض. نأمل أن تُساعدكَ هذه الخدمات. ونرجو أن تُحسن استخدامها.'
      '\n'
      ''
      '-GlobCare تساعد على الحصول على الخدمات المُتميزة من قبل الأطباء المتخصصة في هذا المجال، وتعطيكَ المعلومات الصحية، وكذلكَ الإجابات لكل أسئلتك، بالإضافة إلى بعض النصائح لمساعدتك على الشعور بالتحسن والسعادة والاستمتاع بجودة حياة صحية .'
      '\n'
      '-في الحالات الطارئة: اتصل بمُقدم خدمات الطوارئ المحلية أو الطبيب الخاص بكَ على الفور إذا كنت تعتقد أنك قد يكون أو لديكَ بالفعل حالة طبية طارئة. يمكنك الاتصال بالهلال الأحمر السعودي 997'
      '\n'
      '-الأطباء الموجودين على تطبيق  GlobCare  هم أطباء محترمين مُعتمدين ومرخصين من الهيئة السعودية للتخصصات الصحية أما الأطباء الذين أصبحت تراخيصهم أو كانت مُعلقة أو ملغية، لأي سبب من الأسباب، فهم غير مسموح لهم بالمشاركة بأي شكل من الأشكال.'
      '\n'
      '-GlobCare  ليس محلا لممارسة الطب او تقديم الرعاية الصحية. أنتَ تفهم وتوافق على أن الخبراء الطبيين الموجودين على تطبيق  GlobCare  لا يحلوا محل طبيب الرعاية الأولية الخاص بكَ وعدم استخدامه كبديل عن تعاملكَ مع طبيب الرعاية الأولية الخاصة بكَ. انت توافق على ان استشارة عن بعد قد لا توفر تشخيص دقيق وكامل او أي فحص جسدي وقد يتطلب الامر التحويل الى طبيبك المعالج جسديا او طبيب الرعاية الأولية.'
      '\n'
      '-تستطيع على  GlobCare  ان تحصل على الاستشارات الظاهرية بالإضافة إلى إمكانية التشخيص وإعطاء الوصفات الطبية.'
      '\n'
      '-لا تستخدم محتوى تطبيق  GlobCare  في الحالات الطارئة المحتملة او الفعلية.'
      '\n'
      '-لسنا بديلًا عن الفحوصات الطبية أو العلاج ولسنا بديل عن التامين الصحي او الطبيب المعالج او الزيارة المنزلة فنحن لسنا بمستشفى ولذلك انت توافق على الوصفات الطبية محددة بأنواع معينة وبمدة معينة وتوافق على عدم وصف وصفات لا تسمح بها  GlobCare .'
      '\n'
      '-	يمكنك استشارة طبيبكَ الشخصي أو مقدم الرعاية الصحية الخاص بكَ إذا كان لديك أي أسئلة حول وجود أي أعراض أو حالة طبية، وكذلكَ قبل بدء أو إيقاف أي علاج وصفه لكَ الطبيب المُعالج أو مقدم الرعاية الصحية الخاص بكَ، أو قبل البدء في تناول أي دواء وتغيير في الخطة العلاجية.'
      '\n'
      '-	يمكن استخدام التطبيق للرعاية الطبية المحدودة عبر الاستشارات عن بعد وذلك حسب الضرورة.'
      '\n'
      '-	أي معلومات يقدمها المريض هي على مسؤوليته الخاصة.'
      '\n'
      '-	لا نكشف معلومات شخصية عن المرضى انت تفهم وتوافق على أن اختياركَ استخدام خدماتنا تعني أن معلومات التعريف الخاصة بكَ ستكون مُتاحة للأطباء الذين تتواصل معهم'
      '\n'
      '-	 أنتَ مسؤول عن حسابك: أنتَ المسؤول عن الحفاظ على كلمة المرور الخاصة بكَ وعن أي استخدام لحسابكَ.'
      '\n'
      'رجاء أعلمنا على الفور بأي استخدام غير مصرح به لكلمة المرور أو الحساب. لا يمكنكَ السماح لأي شخص أو كيان آخر باستخدام هويتك للنشر. لا تضع اسمك الحقيقي أو أي معلومات أخرى يمكن استخدامها للتعرف عليك أو أي شيء آخر تقوم بنشره ويكون مرئي للجميع.'
      '\n'
      '-	يمكننا في أي وقت اجراء تحديث على الشروط والاحكام وانت توافق على هذه التغييرات بمجرد استمرارك باستخدام التطبيق. انت لديك الحرية المطلقة في استخدام تطبيق  GlobCare  من عدمه. إذا لم توافق على كل الشروط والاحكام الرجاء عدم استخدام التطبيق. نحن نشجعك على مراجعة شروط الاستخدام المنصوص عليها في هذه الاتفاقية بشكل دوري. حيث إن استمرار استخدامكم لموقعنا بمثابة موافقتكم على شروط الاستخدام التي تم تغييرها.'
      '\n'
      '-	نحن ندعم قراراتكَ الصحية والخيارات التي تقوم بها. انت لكَ كامل الحرية لتحديد هذه القرارات والخيارات، ونحن نؤمن بأنكَ أفضل من يتخذ قرار عندما يتعلق الأمر بصحتكَ. يجب أن تتخذ هذه القرارات استنادًا على المشورة قد تلقيتها من خلال علاقتكَ الرسمية مع الطبيب. لا نقرر شيئا نيابة عنك. يمكننا فقط مساعدتكَ في العثور على معلومات صحية جيدة، كلما كان هذا متاحًا ومُناسبًا، بالإضافة إلى إمكانية استخدام  GlobCare  للتواصل مع اطباؤنا.'
      '\n'
      '-	جميع الآراء والبيانات المنبثقة من الأطباء على التطبيق ما هي إلا آراءهم الفردية المستقلة وتصريحات هذا الشخص.'
      '\n'
      '-	يشترط لاستخدامك لهذا الموقع بطريقة قانونية، كما يجب أن تكون بالغاً حتى يمكنك استخدامه.'
      '\n'
      '-	يشترط ان يكون استخدامك لأي محتوى أو أي خدمة من خدماتنا متفقاً مع جميع أحكام القوانين واللوائح والمراسيم المعمول بها حاليًا في المملكة العربية السعودية. يجب ألا يقل عمرك عن 15 سنة حتى يمكنك استخدام هذا الموقع بإذن من ولي أمرك، أو 18 عام حتى يمكنك استخدامه بدون إذن ولى أمرك.'
      '\n'
      '-	يجوز استخدام تطبيقنا من أجل الأغراض الشخصية والمنزلية والتعليمية فقط، دون الأغراض التجارية وذلك وفقًا لجميع أحكام القوانين المحلية المعمول بها.'
      '\n'
      '-	انت موافق ضمنياً على عدم اكتساب أو حذف أو جمع أية معلومات عن فريقنا لأي سبب من الأسباب، بما في ذلك سبيل المثال لا الحصر إرسال رسائل غير المرغوب فيها، عن طريق التطبيق او الرسائل والبريد الإلكتروني.'
      '\n'
      '-	انت توافق على استخدام التطبيقات وأية خدمة بطريقة مسؤولة وبأساليب غير: متعارضة مع القانون، أو بطريقة غير تهديدية، أو مضايقة، أو مسيئة، أو تشهيرية، أو افترائية، ¬أو ضارة على القصر، أو مبتذلة، أو صارمة دون مبرر أو قذرة أو إباحية أو غير لائقة أو خليعة أو اقتحام خصوصية الغير أو عرقية أو غير ذلك من طرق الاعتداءات أو الكراهية أو المسيئة.'
      '\n'
      '-	انت توافق على عدم الافراط في استخدام أي خدمة، أو خدمة متميزة عمدًا، أو استخدام أي خدمة، أو خدمة متميزة طبيًا في أغراض غير مناسبة.'
      '\n'
      '-	تعتبر أي محاولة من قبل أي فرد أو كيان للحصول على معلومات تسجيل الدخول لأي مستخدم آخر أو أحد أعضاء فريقنا أو للوصول إلى أي حساب بمثابة انتهاك صريح ومباشر لشروط الاستخدام الماثلة وكذلك لأحكام القانون المعمول به، بما في ذلك أحكام قوانين الخصوصية والأمن ذات الصلة وأحكام قوانين الحظر غير عادلة أو الممارسات التجارية غير الأخلاقية، والتي تؤدي إلى اتخاذنا إجراءات قانونية ضد أي فرد أو كيان ممن يعملون على انتهاك هذه الخصوصية.'
      '\n'
      '-	يتحمل المستخدمين المسجلين ضمن هذا الموقع أو زوار الموقع في حالة وصولهم إلى المحتوى والخدمات الخاصة بنا من تلقاء أنفسهم، مسئولية الامتثال لأحكام القوانين المحلية.'
      '\n'
      '-	انت توافق على أنه يجوز لنا جمع معلوماتك واستخدامها والإفصاح عنها إلى كيانات أخرى خارج نطاق المنطقة التي تقيم فيها. بالإضافة إلى ذلك،'
      '\n'
      '-	انت توافق على عدم تحميل أية مراسلات أو نقلها أو أي محتوى من أي نوع يؤدي إلى خرق أو انتهاك أية حقوق لأي طرف.'
      '\n'
      '-	انت توافق على انه قد يتم تخزين هذه المعلومات على الموقع المخصص للخدمات والذي يقع خارج نطاق المنطقة القضائية المقيمين فيها.'
      '\n'
      '-	لا يمكنك استخدام هذه التطبيقات إلا بموجب ترخيص منا. ونحيط سيادتكم علمًا بأن هذ الترخيص هو ترخيص شخصي ولذا فإنه غير قابل للإلغاء أو التنازل، كما أنه غير حصري.'
      '\n'
      '-	انت توافق على انه جميع البيانات الخاصة بسيادتكم باستثناء أي بيانات أو معلومات شخصية ملكًا لموقعنا'
      '\n'
      '-	لدينا الحرية في استخدم أي أفكار، أو مفاهيم، أو معرفة، أو تقنيات ترد في أي مراسلة ترسلها إلينا فيما يتعلق بأي غرض أيًا كان نوعها، بما في ذلك تطوير والتسويق المنتجات باستخدام هذه المعلومات'
      '\n'
      '-	انت توافق على الالتزام بتوجيهاتنا التي قدمناها اليك سلفا.'
      '\n'
      '-	في حالة خرق أو انتهاك أيً من البنود المنصوص عليها في هذه الاتفاقية، فإنه يتم إنهاء تصريحكم باستخدام محتوى الموقع وخدماته على الفور، ويجوز لنا في هذه الحالة وضع حد أو تعديل أو إنهاء حقك في الوصول إلى موقعنا، او استخدامه، أو استخدام محتواه، أو خدماته في أي وقت، وقد يؤدي هذا الإنهاء أو التعليق إلي حذف المعلومات والملفات والمحتويات الأخرى التي تم توافرها سابقًا.'
      '\n'
      '-	لا يتحمل الموقع أيه مسئولية على الإطلاق عن محتوى الاستشارات التي تم إنشاؤها، أو تعديلها، أو تقديمها، أو تثبيتها من قبل الأطباء وذلك في الحالات الأتية:'
      '\n'
      '•	في حالة التسبب في أيه خسارة، أو وفاة، أو إصابة بشكل كليًا، أو جزئي من خلال الإهمال او خطأ طبي.'
      '\n'
      '•	في حالة وجود أي خطأ أو سهو أو عدم الدقة في مثل هذه المعلومات'
      '\n'
      '•	أي شيء تقوم به باستخدام خاطئ الاطباء، وتطبيقاتنا أ/والمعلومات الواردة في هذا الموقع'
      '\n'
      '•	أي انتهاك لأحكام القانون الناجم عن سيادتكم من خلال استخدام الاطباء'
      '\n'
      '•	أي محتوى تم نشره أو إتاحته من خلال الاطباء.'
      '\n'
      '•	في حالة إصدار أي قرار أو اتخاذ إجراء أو عدم اتخاذه اعتمادًا على هذه المعلومات، مما يعني أنه لا يمكنك الاعتماد على قرار الاطباء أو اتخاذ قرارات طبيبة أو غيرها من القرارات الهامة على هذا الأساس'
      '\n'
      '•	للحصول على المشورة الطبيبة أو العلاج أو التشخيص، فعليك مراجعة طبيبك الشخصي أو مقدم الرعاية الصحية.'
      '\n'
      '-	في حالة عدم رضائكم عن أي من المحتويات أو المواد الموجودة على موقعنا أو أي خدمات أو معلومات متوافرة من خلاله أيضًا، فإن سبل الانصاف الوحيدة والحصرية لسيادتكم هيا التوقف عن الوصول لموقعنا واستخدامه.'
      ''
      '\n'
      '-	 في حالة تقديمنا إصدارًا لهذه الاتفاقية باللغة الإنجليزية، فإنه يتم التحكيم في هذه الاتفاقية باللغة العربية عند وجود تعارض باللغة الإنجليزية.'
      '\n'
      '-	تحل هذه الاتفاقية محل أي اتفاقيات سابقة ما لم تنص الاتفاقية السابقة أو اللاحقة صراحة على خلاف ذلك، أو تشير على هذه الاتفاقية على وجه التحديد. في حالة وجود أي تعارض بين الاتفاقية الماثلة وبين الاتفاقية الخطية الموقعة بشكل متبادل بيننا فيما يتعلق بموقعنا، ففي مثل هذه الحالة تطبق أحكام الاتفاقية الخطية الموقعة.'
      '\n'
      '\n'
      'انت توافق على ان مدة الاستشارة ١٠ دقائق وبمجرد دفعك المبلغ لابد من الدخول الاستشارة فورا حيث ان الاستشارة فورية ويكون الطبيب بانتظارك وفي حال عدم دخولك تحتسب الاستشارة'
      '\n'
      '\n'
      'في حال الشكاوى نرجو الاتصال بقسم الدعم عبر البريد الإلكتروني التالي'
      '\n'
      '-	 ايميل: info@glob-care.com'
      '\n'
      '-	اتصال : 920015220'
      '\n'
      '-	واتس: 0549100105'
      '\n'
      '-	بالتواصل المباشر على الموقع (glob-care.com)'
      '\n'
      '-	 إذا لم يستطيع فريق الدعم التابع للموقع على حل الشكوى او النزاع المقدم بشكل قانوني عندئذ نتعهد معًا على حل مثل هذه النزعات من خلال التحكيم أو المطالبات الصغيرة بدلاً من المحاكم ذات الاختصاص العام، كما نطلب من سيادتكم مساعدتنا في حل هذه النزاعات في غضون ثلاثون يومًا بعد إخطارنا بهذه القضايا قبل تقديم الأمر إلى التحكيم.'
      ''
      '\n'
      '\n'
      ''
      ''
      '';
}
