import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:get/get.dart';
import 'package:getwidget/getwidget.dart';
import 'package:globcare/app/core/theme_helper/app_colors.dart';
import 'package:globcare/app/global_widgets/shared/ui_helpers.dart';

import '../../../../core/language_and_localization/app_strings.dart';
import '../../../../core/theme_helper/app_styles.dart';
import '../../../../global_widgets/ui.dart';

class CaregiverContractDetails extends StatelessWidget {
  CaregiverContractDetails({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Column(children: [

      Ui.titleGreenUnderLine(AppStrings.caregiverContractDetails.tr,
          bottomPadding: 8),

      ...termsOfServicesClause.map((e)=>  Directionality(
        textDirection: TextDirection.rtl,
        child: Column(
          mainAxisAlignment: MainAxisAlignment.start,
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [


            GFAccordion(
                title:e['title'],
                // content: e['description'],
                contentChild: Text(e['description'],style: AppStyles.primaryStyle(fontSize: 15,height: 1.8,color: AppColors.textColorLight),),
                collapsedIcon: Icon(Icons.keyboard_arrow_left),
                expandedIcon: Icon(Icons.keyboard_arrow_up),
              expandedTitleBackgroundColor: AppColors.primaryColorOpacity,
              collapsedTitleBackgroundColor: AppColors.primaryColorOpacity,
             margin: EdgeInsets.zero,
             titlePadding: EdgeInsets.symmetric(vertical: 15.h,horizontal: 10.w),
             titleBorderRadius: BorderRadius.circular(10.r),
             textStyle: AppStyles.primaryStyle(color: AppColors.primaryColor,bold: true,fontSize: 14),




             // contentPadding: EdgeInsets.zero,


             // titleBorder: Border(bottom: BorderSide(color: AppColors.primaryColor.withOpacity(.2))),

            ),

            // Text(
            //   e['title'],
            //   textDirection: TextDirection.rtl,
            //   style: AppStyles.primaryStyle(
            //       fontSize: 18, opacity: .8, height: 1.5,bold: true,color: AppColors.primaryColor),
            // ),
            // UiHelper.verticalSpaceSmall,
            // Text(
            //   e['description'],
            //   textDirection: TextDirection.rtl,
            //   style: AppStyles.primaryStyle(
            //       fontSize: 18, opacity: .8, height: 1.9,color: AppColors.primaryColor),
            // ),
            UiHelper.verticalSpaceSmall,

          ],
        ),
      ) ).toList()


    ],);
  }

  final List<Map> termsOfServicesClause =[

  {

    "title":"تمهيد",
    "description":""
        "لما كان شركة جلوب كير شركة متخصصة في تقديم خدمات الرعاية الصحية، ولديه الخبرات والامكانيات اللازمة لتوفير خدمات الرعاية الصحية المنزلية، ولرغبة العميل في الاستفادة من خدمات شركة جلوب كير لتقديم خدمات الرعاية الصحية المنزلية داخل المملكة، لذا فقد اتفق الطرفان وهما بكامل أهليتهما المعتبرة شرعا ونظاما على أن يقوم شركة جلوب كير بتقديم خدمة الرعاية الصحية وذلك بتوفير كوادر بشرية بعدد (1) من الكوادر البشرية الموضحة بياناته أدناه لمدة (30) يوما وفق الشروط والأحكام التالية:"
        ""
"\n"

 " 1.	أن يتقاضى شركة جلوب كير من العميل مبلغا بقيمة (280) ريال سعودي عن كل مقدم رعاية لكل يوم عمل في يوم اجازة الأسبوع والعطلات الرسمية (الاعياد و المنسابات الرسمية مثل اليوم الوطني و غيرها)"
 "\n"
        " 2.	يقوم العميل بدفع تلك المستحقات المالية المرسلة من شركة جلوب كير على حساب الشركة"
  "\n"
        "3.	في حال عدم التزام العميل بدفع رسوم أيام الإجازات والعطلات الرسمية، فإنه يحق للطرف الأول أن يحسم من أيام العقد بعدد أيام الإجازات أو العطل الرسمية."
  "\n"
        "4.	سيتم اشعار العميل بمستحقات الشهر القادم قبل نهاية الشهر المقدم فيه الخدمة بعشرة ايام، على ان يتم سداد المستحقات المالية قبل بداية الشهر بمدة اقصاها خمسة ايام من نهاية العقد."

        "\n"
        "",

  },


    {

      "title":"مدة العقد",
      "description":""
          ""
          "1.	مدة هذا العقد تحدد وفقاً لما هو وارد في الجدول المذكور أعلاه، وفي حالة عدم التزام العميل باستلام الكادر البشري خلال (1) يوم فأكثر من تاريخ توقيع العقد فإنه يحق للطرف الأول القيام بأحد الإجراءات التالية: "
    "\n"
    "أ – إلغاء العقد وإعادة المبلغ المدفوع للطرف الثاني بعد خصم القيمة اليومية للخدمة حسب العقد."
      "\n"
   " ب – استمرار العقد مع التزام العميل بدفع مبلغ القيمة اليومية للخدمة حسب العقد."
    ""
          "\n"
          "2.	يتجدد العقد تلقائيا لمدة أو مدد مماثلة في حال عدم إخطار أحد الطرفين الآخر بالرغبة بعدم التجديد بمدة لا تقل عن (7) أيام من تاريخ انتهاء المدة الأصلية أو المجددة، علماً أن العقد المجدد قد يكون مختلفاً في بنوده عن هذا العقد."

          ""
          ""
          ""
          ""
          ""
          ""
          "",

    },

    {

      "title":"التزامات شركة جلوب كير",
      "description":""
    "1.	يلتزم شركة جلوب كير بتوفير الكوادر البشرية وتجهزهم للعمل لدى للطرف الثاني في الموعد المتفق عليه حسب الإتاحة."
   "\n"
    "2.	يلتزم شركة جلوب كير بتقديم خدمات الكادر البشري المحددة للطرف الثاني وفقاً لما تضمنه الجدول المذكور أعلاه، ووفقاً للآلية المتفق عليها في العقد."
      "\n"
    "3.	يلتزم شركة جلوب كير باختيار الكوادر من ذوي الخبرة والكفاءة."
    ,

    },

    {

      "title":"التزامات العميل",
      "description":""
          ""
          "1.	 يلتزم العميل بسداد قيمة العقد المتفق عليها عند توقيع العقد."
      "\n"
    "2.	يلتزم العميل أن يعامل الكادر البشري المقدمة خدماتها بالاحترام اللائق، وأن يمتنع عن كل قول أو فعل يمس الكرامة أو الديانة أو الممتلكات الخاصة ، وإذا تقدمت الكادر البشري بشكوى تتضمن مخالفة هذا البند فيحق للطرف الأول في حال ثبوت انتهاك العميل لهذا الفقرة استعادة الكادر البشري وفسخ العقد وخصم 25% من قيمة المدة المتبقية في العقد واللجوء للجهات المختصة."
    "\n"
          "3.	يلتزم العميل بتحمل كامل المسؤولية النظامية والشرعية والمالية عن أية تجاوزات تلحق أضراراً بالكادر البشري، أو أي غرامات مترتبة لارتكاب الكادر البشري مخالفة للأنظمة والقوانين داخل المملكة العربية السعودية أو خارجها نتيجة توجيه العميل أو أحد أفراد أسرته أو من له علاقة به بالقيام بأعمال غير نظامية أو إهمالهم أو توجيههم باستخدام معدات أو آليات غير مُصرح لهم باستخدامها مما يترتب عليه مخالفات أو غرامات أو إصابات لهم أو للغير، وفي حال ثبت ذلك فإنه يحق للطرف الأول فسخ العقد واستعادة الكادر البشري وتحميل العميل كافة ما يترتب على ذلك من تكاليف وغرامات وغيرها."
   "\n"
    "4.	يلتزم العميل بإشعـار شركة جلوب كير كتابياً في حالة تغيب الكادر البشري عن العمل خلال مدة أقصاها (24) ساعة عن طريق ارسال ايميل إلى (info@glob-care.com) وكتابة اقرارا بذلك، وفي حالة عدم الإشعار بذلك كتابياً فإن العميل يتحمل المسؤولية القانونية وكافة ما يترتب على ذلك من تكاليف أو غرامات وغيرها، وفي حال كان التغيب بسبب سوء المعاملة من جانب العميل أو أحد أفراد عائلته  أو من له علاقة به، أو قام العميل بالإبلاغ ببلاغ تغيب غير صحيح فإنه يتحمل المسؤولية القانونية وكافة ما يترتب على ذلك من تكاليف أو غرامات وغيرها، بالإضافة إلى القيمة اليومية للخدمة لكل يوم من تاريخ قيامه بالإبلاغ بأثر رجعي، كما يحق للطرف الأول فسخ العقد دون تعويض العميل بكادر بشري بديلة مع خصم 25 % من قيمة العقد للفترة المتبقية من العقد."

          "\n"
          "5.	يلتزم العميل بتحمل كافة نفقات السفر من (التذاكر، الرسوم، الخروج / العودة، إلى آخره) عند مرافقة مقدم الرعاية الصحية للمريض وسيكون مسؤولاً عن كل المستندات المطلوبة (تأشيرة الزيارة، ......إلخ) ويلزم العميل بإرسال خطاب ابلاغ قبل اجراءات السفر يحدد فيه الوقت واليوم من أجل الحصول على موافقة خطية من قبل شركة جلوب كير."
    "\n"
          "6.	إضافة لقيمة العقد يلتزم العميل بدفع (150 ريال لكل يوم) عن كل موظف من موظفي شركة جلوب كير والمصرح لهم السفر برفقة العميل عندما يتطلب العمل خارج المملكة العربية السعودية ودفع كافة النفقات المتعلقة بهم من اعاشة وسكن."
   "\n"
    "7.	يلتزم العميل بعدم تشغيل الكادر البشري في أي أعمال تختلف عن المهنة المحددة ضمن هذا العقد، كما أنه لا يحق تشغيل الكادر البشري لدى الغير أو إعادة تقديم خدماتهم للغير،  ويحق للطرف الأول في حال ثبوت ارتكاب العميل لأي مما سبق، يحق للطرف الأول فسخ العقد واستعادة الكادر البشري مع بقاء حقه في الرجوع على العميل بكافة المصاريف والتكاليف والغرامات المترتبة على ذلك."
    "\n"
          "8.	يلتزم العميل بتوفير السكن المناسب الكادر البشري  ويكون مستقلاً ومكيفاً، ويجب توفير مستلزمات العناية الشخصية مثل: الشامبو والصابون وفرش الأسنان وخلافه."
    "\n"
          "9.	يلتزم العميل بتوفير بيئة عمل مناسبة الكادر البشري تتوفر فيها عوامل السلامة والأمان وألا يتم تكليفهم بعمل خطر يهدد صحتهم أو سلامتهم الجسدية أو العقلية أو يمس كرامتهم الإنسانية."

      "\n"
          "10.	يلتزم العميل بعدم تشغيل الكادر البشري لأكثر من 12 ساعة في اليوم،  ويلتزم كذلك بتمكين الكادر البشري من أخذ قسط من الراحة والنوم يومياً لمدة لا تقل عن (9) ساعات متواصلة على الأقل بالإضافة إلى إعطائهم فترات متقطعة لا تقل عن نصف ساعة للراحة وأداء الصلوات أثناء ساعات العمل اليومية، كما يلتزم بإعطائهم يوم إجازة أسبوعي لا يتخلله أي مهام توكل إليهم."

      "\n"
          "11.	يلتزم العميل بتوفير عدد (3) وجبات صحية يومياً الكادر البشري ، وفي حالة عدم توفير الطعام من قبل العميل للكادر البشري، يلتزم بدفع بدل إعاشة مبلغ وقدره (300) ريال، وفي حال عدم التزام العميل بأي من ذلك،  يحق للطرف الأول فسخ العقد وإعادة الكادر البشري."
    "\n"
          "12.	يلتزم العميل في حال حاجة الكادر البشري للرعاية الطبية بمراجعة مركز طبي معتمد في شبكة المراكز الطبية لشركة التأمين المعتمدة لدى شركة جلوب كير أو معالجة الكادر البشري على حساب العميل بدون تحمل شركة جلوب كير أي تكلفة، كما يلتزم العميل بإبلاغ شركة جلوب كير مباشرة في حالة حصول إصابات العمل وإلا تحمل العميل التعويضات اللازمة للكادر البشرية وفقاً للنظام المعمول به بالمملكة العربية السعودية."
    "\n"
          "13.	يلتزم العميل بإحضار الكادر البشري أثناء سريان العقد عند طلب شركة جلوب كير وذلك خلال مدة أقصاها (3) يوم من تاريخ الطلب وإلا فإن العميل يتحمل كافة التكاليف والغرامات والأضرار الناتجة أو المترتبة على ذلك."
    "\n"
          "14.	يلتزم العميل بالحضور إذا لزم الأمر لاستلام بطاقة الصراف الآلي، ويتحمل المسؤولية حال عدم قيامه بذلك."
   "\n"
    "15.	يلتزم العميل بتوصيل الكادر البشري إلى أقرب فرع بنك أو جهاز صراف آلي لصرف مرتباتهم شهرياً وقت حلولها ومساعدتهم لتحويل أية مبالغ يرغبون بتحويلها إلى ذويهم أو غير ذلك."

    "\n"
          "16.	يلتزم العميل في حالة إرجاع الكادر البشري لأي سبب كان أن يقوم بتسليم الكادر البشري لمركز إيواء شركة جلوب كير."
   "\n"
    "17.	يلتزم العميل في حالة طلب توصيل الكادر البشري بدفع مبلغ وقدره ..... ريال."
  "\n"
    "18.	يلتزم العميل في حالة طلب ارجاع الكادر البشري بتوصيل الكادر البشري  إلى نقطة التسليم التي يحددها شركة جلوب كير ويتحمل العميل كافة المسؤوليات والتبعات المالية على سبيل المثال لا الحصر استمرار احتساب التكلفة اليومية حتى تاريخ اقرار شركة جلوب كير باستلام الكادر البشري من قبل العميل ."
  "\n"
    "19.	يلتزم العميل بعدم تكليف الكادر البشري بأي مهام خارج نطاق مهام العناية بالمريض المذكورة في البند الخامس من هذا العقد."

   "\n"
    "20.	في حال عدم إضافة خدمة الإشراف الطبي المتخصص من قبل شركة جلوب كير ، يلتزم العميل بأن تقديم الأدوية للمريض يكون تحت إشرافه أو إشراف المريض أو الوصي."
   "\n"
          " 21.	يلتزم العميل بإبلاغ شركة جلوب كير في حال حدوث أي تغيير في عنوان إقامته."
          ""
          "",

    },

    {

      "title":"مهام مقدمي الرعاية",
      "description":""
          ""
          " تقتصر مهام مقدمي الرعاية -حسب حالة الشخص محل الرعاية- على ما يلي:"
  "\n"
    "1.	إعطاء الأدوية بناء على الوصفة الطبية وفق جدول زمني منضبط في حال اضافة خدمة الإشراف الطبي من شركة جلوب كير."
   "\n"
    "2.	 التغذية عبر الفم أو عبر الأنبوب -إن لزم الأمر-."
"\n"
    "3. العناية بالأطفال حديثي الولادة."
      "\n"
    "4.  قياس العلامات الحيوية للمريض."
      "\n"
    "5. العناية بالقسطرة."
      "\n"
    "6. العناية بالنظافة الجسدية للمريض: تغيير الحفائظ، المساعدة على الاستحمام، تقليم الاظافر."

          ""
          "",

    },
    {

      "title":"أحكام استبدال وإعادة الكادر البشري",
      "description":""
          ""
          "1.	استبدال الكادر البشري: لا يحق للطرف الثاني طلب استبدال الكادر البشري إلا في حال ثبوت وجود مشكلة يتعذر معها على الكادر البشري القيام بمهامها، ويكون تقييم ثبوت وجود مشكلة عائد للطرف الأول وحده، ويحدد ما إن كان الأمر يتطلب الاستبدال أم لا، وفي حال قرر شركة جلوب كير قبول طلب الاستبدال، ولم يوجد بديل فيعيد شركة جلوب كير للطرف الثاني المبلغ المدفوع عن المدة من تاريخ تسليم الكادر البشري المرغوب استبدالها للطرف الأول."

      "\n"
    "2.	إعادة الكادر البشري: عند رغبة العميل في إعادة الكادر البشري فإنه يحسم منه (قيمة عدد الأيام التي بقيت فيها الكادر البشري لديه+ 25% من قيمة العقد)."

          "",

    },
    {

      "title":"انتهاء أو إلغاء العقد",
      "description":""
          ""
          ""
          "1.	يحق للطرف الأول إنهاء العقد بموجب إخطار يقدم إلى العميل بمدة لا تقل عن (7 ) أيام  من تاريخ الإنهاء. "
          "\n"

          " 2.	عند رغبة العميل بإلغاء العقد قبل استلام الكادر البشري في اليوم الأول من توقيع العقد يتم حسم ما قيمته ( 10% ) من القيمة الإجمالية للعقد وفي حالة الإلغاء بعد تجاوز اليوم الأول من تاريخ توقيع العقد وقبل الاستلام فإنه يتم حسم القيمة اليومية للخدمة عن كل يوم حتى يوم الإلغاء."
          "\n"

          " 3.	يلتزم العميل بإعادة الكادر البشري التي انتهت مدة عقودها للطرف الأول في التاريخ المحدد في العقد، وفي حال عدم الالتزام بذلك يتم احتساب مديونية تسجل على العميل بما يعادل ( عن كل يوم تأخير  تعويض بقيمة 450 ريال ) ."
          "\n"

          " 4.	في حالة الغاء العقد من قبل العميل وقبل انتهاء مدة العقد فيتم خصم 25% من القيمة اليومية للخدمة عن المدة المتبقية من العقد."
          "\n"

          " 5.	في حال وفاه العميل او الشخص المقدمة له الخدمة لا قدر الله فانه يتم انهاء العقد دون اي قيمة اضافية على العميل وذلك من تاريخ ابلاغ شركة جلوب كير بحالة الوفاة واستلامه للعاملة الا اذا رغب العميل في استكمال العقد."
          "\n"

   " 6.	عند انتهاء العلاقة التعاقدية في حال وجود أي مبالغ إضافية متبقية في محفظة العميل لدى شركة جلوب كير، فإن شركة جلوب كير يلتزم برد هذه المبالغ إلى الحساب البنكي الخاص بالعميل خلال مدة أقصاها (15) يوم  عمل، وذلك بعد أن يقوم العميل بإشعار شركة جلوب كير برغبته في ذلك مع تزويده بكافة البيانات اللازمة."
          "\n"

          " 7.	للطرف الأول الحق بإلغاء العقد مع احتفاظ شركة جلوب كير بحقوقه الكاملة المترتبة على هذا العقد عند تحقق احدى الحالات الواردة ادناه على سبيل المثال لا الحصر، كما يتحمل العميل الاضرار التي لحقت بشركة جلوب كير تجاه ذلك، ومنها على سبيل المثال:"
          "\n"

          " أ‌.	إذا كلف العميل الكادر البشري بالقيام بأعمال تختلف اختلافا جوهريا عن طبيعة عمله."
          "\n"

          " ب‌.	إذا وقع اعتداء من العميل او من ينوب عنه او فعل مخل بالأخلاق او الآداب نحو الكادر البشري."
          "\n"

          " ت‌.	إذا كان هناك خطر جسيم يهدد سلامة او صحة الكادر البشري."
      "\n"
    "ث‌.	إذا اتسمت معاملة العميل بمظاهر القسوة والجور او الإهانة."
      "\n"
    "ج‌.	القوة القاهرة."

          "",

    },
    {

      "title":"الأحكام العامة",
      "description":""
          "-	لا يشمل هذا العقد أي خدمات طبية أو تمريضية متخصصة الا في حال تم توقيع عقد إضافي خاص بتقديم خدمات متخصصة مثل رعاية الامراض المتقدمة والتي تحتاج الى اشراف تخصصي من قبل طواقم شركة جلوب كير  أو مستشفيات أخرى."
    "-	يقر العميل أن شركة جلوب كير قد أفهمه أن جميع الحالات الطارئة أو المهددة للحياة لا يتم التواصل فيها مع شركة جلوب كير وانما مع المستشفيات والهلال الأحمر ومن في حكمهما."
    "-	يقر العميل بأن المريض ليس له أي تاريخ مع إدمان المخدرات، أو محاولة انتحار سابقة خلال اخر سنه من التعاقد."
    "-	يقر العميل بأنه ليس للمريض أي إساءة سابقة لطاقم الرعاية الصحية المنزلية أو للخدمات المقدمة منهم."
    "-	يقر العميل أن المريض لا يعاني من أمراض نفسية معقدة ومتقدمة Psychosis او احد القاطنين في نفس المنزل قد تؤثر على سلامة وأداء موظفي شركة جلوب كير."
    "-	يقر العميل بأنه في حال فقدان، سرقة، إتلاف ممتلكات العميل يتم التعامل وفقاً للإجراءات النظامية في المملكة العربية السعودية دون أدنى مسؤولية على شركة جلوب كير."
    "-	تصرف رواتب ومستحقات الكادر البشري من قبل شركة جلوب كير فقط، ولا يعتد بأي إدعاء من قبل العميل فيما يخص صرف أي مبالغ مالية للعاملة كسلف أو رواتب أو خلافه، حيث أن شركة جلوب كير غير مسؤول بأي شكل من الأشكال عن أي مستحقات مالية أو عينية للطرف الثاني لدى الكادر البشري."
    "-	لا يحق للطرف الثاني خصم أية مبالغ من قيمة الدفعات المستحقة للطرف الأول لأي سبب كان."
    "-	لا يحق للطرف الثاني عند استبدال الكادر البشري تأجيل الاستلام في حال التوفر، وفي حالة عدم الاستلام فيحق للطرف الاول فسخ العقد وإرجاع المتبقي من القيمة اليومية للخدمة عن الفترة المتبقية من العقد للطرف الثاني بعد خصم 25 % منها."
    "-	 يقر العميل بعدم سعيه لتوظيف والحصول على خدمات مقدمي العمالة الذي قام شركة جلوب كير بتوفيرهم وذلك اثناء فترة سريان العقد ولمدة سنتين بعد انتهائه."
    "-	في حال تفعيل أي نوع من أنواع الضرائب في المملكة العربية السعودية، سيتم إضافته على قيمة التسعيرة الحالية , دون الرجوع أو اشعار مسبق للعميل، ويقر العميل بتحمله تلك الرسوم أو الضرائب."
    "-	في حال قام العميل بسداد قيمة الخدمة أو الخدمات بأي طرق السداد يعد إقرار وموافقة من قبله على العقد وجميع شروط العقد."
          "",

    },
    {

      "title":"المنــــــــازعات والــــــــخلافـات",
      "description":""
          ""
          "في حالة حدوث أي نزاع بين الطرفين يتم حلها ودياً من خلال اللجوء للإدارة المختصة لدى شركة جلوب كير، وإذا لم يتم التوصل إلى حل يتم تصعيد النزاع للإدارة التنفيذية العليا لدى شركة جلوب كير، وإذا لم يحل خلال (15) يوماً من تاريخ التصعيد، فإنه يتم إحالة النزاع للمحكمة المختصة في المملكة العربية السعودية في مدينة الرياض للنظر فيها.",

    }
,
    {

      "title":"الإخـــــــــطارات والإشــــــــــعارات",
      "description":"تتم جميع الإخطارات والإشعارات بين الطرفين كتابةً عن طريق البريد الإلكتروني المسجل أعلاه أو الهواتف أي كان نوعها، وتـوجه الإخـطارات إلى العـنوان الموضـح لـكل مـن الطرفـين فـي صـدر هذا العقد ، ويلتزم العميل بإخطار شركة جلوب كير كتابياً في حال قيامه بتغيير عنوانه أو مكان إقامته أو أي من أرقام الاتصال الخاصة به المسجلة بهذا العقد أو أي من الوثائق لدى شركة جلوب كير، ويتحمل العميل وحده المسئولية كاملة وكافة ما يترتب عليها من أثار نظامية أو مالية في حال تقصيره في ذلك، كما تعتبر كافة الإخطارات والمكاتبات الصادرة عن شركة جلوب كير والموجهة للطرف الثاني على العناوين المسجلة لديه في هذه الحالة مرتبةً لكافة الأثار القانونية وبحكم المستلمة فعلياً.",

    }
];

}
