import 'package:get/get.dart';

import '../../../base_controller/base_controller.dart';

class PrivacyPolicyLogic extends BaseController {
  bool responsibility = false;
  bool agree = false;

  updateAgree(checked) {
    agree = checked;
    update();
  }

  updateResponsibility(checked) {
    responsibility = checked;
    update();
  }

  bool showCheckBox = true;

  @override
  void onInit() {
    // TODO: implement onInit
    super.onInit();

    if (Get.arguments != null && Get.arguments == false) {
      showCheckBox = false;
      update();
    }
  }

  static const termsOfServicesText = ''
      'حقوق المريض هي سياسات وقواعد يجب الحفاظ عليها وحمايتها من قبل المرفق الصحي تجاه المرضى وعائلاتهم.'
      '\n\n'
      '-	 يمكنك التواصل مع الطبيب باستخدام اتصال الفيديو مباشرة باستخدام هاتفك الذكي او الجهاز اللوحي. محادثاتك واسئلتك الشخصية تتم مباشرة مع الطبيب المتخصص لتوفير العناية المناسبة لحالتك الطبية في الاستشارة'
      '\n'
      '-	معلوماتك الشخصية والصحية التي يتم مشاركتها مع الطبيب اثناء الاستشارة محمية بشكل آمن وفي غاية السرية. وتتم إخفاء جميع المعلومات التي قد تشير الى هويتك عن الاخرين. بما في ذلك السرية التامة في محادثاتك واسئلتك الشخصية ومكالمات الفيديو.'
      '\n'
      '-	خصوصيتك وامان معلوماتك الشخصية والطبية اهم مبادئنا وجزء من سياستنا.. إضافة الى ذلك ندعم القوانين لحمايتك وحماية معلوماتك. تأكد من أن المريض أو الوصي القانوني له على علم تام وواضح حول الحالة والحالة الصحية بلغة مفهومة.'
      '\n'
      '-	امتلاك آلية مناسبة لتثقيفهم بما يكفي للتعامل مع الحالة الطبية للمريض.'
      '\n'
      '-	تزويد المريض بالتغذية الكافية المناسبة لحالته الصحية.'
      '\n'
      '-	إدارة ألم المريض بشكل مناسب'
      '\n'
      '-	اعلم: لكي نساعدك في إيجاد الطبيب المتخصص وتقديم الاجابات الطبية الصحيحة من قبل الأطباء، نقوم باستخدام البيانات التي تساعدنا على توفير هذه الخدمة فقط أو تطوير وتحسين خدماتنا لمزيد من التطور.'
      '\n'
      '-	جميع المعلومات محمية ومؤمنة تماما بما يتوافق مع المعايير المتطلبة. نستخدم التكنولوجيا وسياسات الأمان التي تدعم الشركة على الخصوصية والتأكد من حماية معلوماتك.'
      '\n'
      '-	تستطيع ان تتحكم بخصوصيتك للحفاظ على معلوماتك آمنه وسرية. بإمكانك إضافة، حذف او تعديل أي من معلوماتك الصحية في ملفك الشخصي متى شئت.'
      '\n'
      '-	يمكن الوصول إلى السجل الطبي للمرضى من قبل:'
      '\n'
      'o	الفريق الطبي لرعاية المريض.'
      '\n'
      'o	فريق برنامج إدارة الجودة.'
      '\n'
      'o	فريق أبحاث المرفق الصحي.'
      '\n'
      'o	الأشخاص الذين لديهم تفويض خطي للمريض أو الوصي القانوني أو السلطات القانونية.'
      '\n'
      '\n'
      '-	يحق لك معرفة المعلومات الشخصية التي نجمعها وكيف يتم استخدامها من قبل التطبيق. شعارنا الشفافية وكافة الخصوصية والأمان.'
      '\n'
      '-	الحصول على الجو الملائم أثناء التواصل لتتمكن من وصف حالتك المرضية بشكل واضح وشامل مع احترام خصوصيتك والمحافظة على السرية التامة لكل ما يتعلق بالمرض والعلاج الذي تم وصفه لك.'
      '\n'
      '-	عالج المريض بلطف واحترام، مع تقدير كرامته الفردية، بغض النظر عن الوقت أو الظروف.'
      '\n'
      '-	احترم هوية المريض.'
      '\n'
      '-	احترام القيم والمعتقدات والتفضيلات الثقافية والسيكولوجية الاجتماعية والروحية للمريض.'
      '\n'
      '-	قبول أو رفض خطة العلاج المقترحة من قبل الطبيب المعالج، وذلك بعد معرفتك بتبعات رفضك للعلاج'
      '\n'
      '-	أبلغ المريض عن العلاجات البديلة الأخرى في حال رفض العلاج '
      '\n'
      '-	يتحمل المريض أو الوصي القانوني المسؤولية الكاملة عن قراراته أو تصرفاته في حالة رفضه العلاج أو عدم اتباع تعليماته.'
      '\n'
      '-	الحصول على الرعاية الطبية الشاملة في أي وقت وتحت أي ظرف بصرف النظر عن الاختلافات في الجنسية، أو الديانة، أو الجنس، أو الحالة المرضية.'
      '\n'
      '-	المشاركة في اتخاذ القرار بشأن خطة العلاج الخاصة بحالتك.'
      '\n'
      '-	ناقش المضاعفات المحتملة والمخاطر والفوائد والبدائل للإجراءات المقترحة – إن وجدت – مع المريض أو وصيه الشرعي.'
      '\n'
      '-	الحصول على التشخيص والعلاج الفعَّال للمرض والألم الذي تعاني منه.'
      '\n'
      '-	التواصل مع ممثل رعاية العملاء لتقديم ملاحظة أو شكوى في أي وقت ومعرفة الإجراءات المتبعة لذلك ومتابعة نتائجها'
      '\n'
      '-	يجوز للمريض المشاركة في دراسة بحثية تتعلق بحالة حالته إذا كان قد استوفى متطلباته وبناء على القدرة البحثية.'
      '\n'
      '-	تزويد المريض بمعلومات واضحة وشاملة عن البحث والعلاجي والدوائي بالإضافة إلى النتائج المتوقعة.'
      '\n'
      '-	يحق للمريض إعطاء موافقته أو رفضه للمشاركة قبل أو أثناء البحث أو الدراسة.'
      '\n'
      '-	تقديم استمارة خاصة للمشاركة في أي بحث أو دراسة يجب أن يوقع عليها المريض أو الوصي القانوني عليه.'
      '\n'
      '-	يجب الإشراف على الأبحاث والدراسات من قبل لجنة أو هيئة (علمية / رسمية).'
      '\n'
      '-	اتبع الإجراءات القياسية والواضحة في حماية المرضى وتلقي شكاويهم وآرائهم أثناء إجراء دراسة أو بحث. '
      '\n'
      '';
}
